# Challenge- Advanced manipulation

![](./images/sans-titre.png)

In this challenge, we will explore new advanced Pandas manipulation techniques

**Q1**. Start importing pandas as usual. What version of pandas are you using?

In [1]:
# TODO: import numpy and pandas 
### START ###

import numpy as np
import pandas as pd

print(f'Pandas version is : {pd.__version__}')

### END ###

Pandas version is : 1.0.3

We create two nex Series that we want to manipulate in a DataFrame

In [3]:
series_1 = pd.Series(np.arange(10))
series_2 = pd.Series(list('abcdefghi'))

**Q2** Have a look at both Series
- Concatenate those two series into a single DataFrame (one column per Series) an display result
- Stack those two series vertically and display results

In [8]:
horizontal = pd.concat([series_1,series_2], axis=1)
vertical = pd.concat([series_1,series_2], axis=0)

In [10]:
horizontal.head()

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [12]:
vertical.tail()

4    e
5    f
6    g
7    h
8    i
dtype: object

**Q3**. We create two new series *s1* and *s2* 
- Display the items in *s1* that are not present in *s2*.
> Hint you you may need to use the ~ operator and the pandas function *isin()*

- Display the items that are not common to *s1* and *s2* 
> Hint you might need to use the numpy functions *intersect1d* and *union1d*

In [14]:
s1 = pd.Series([1, 2, 3, 4, 5, 6, 7])
s2 = pd.Series([4, 5, 6, 7, 8, 9, 10])

In [15]:
# TODO : Display the items of s1 not present in s2
### START ###
s1[~s1.isin(s2)]

### END ###

0    1
1    2
2    3
dtype: int64

In [18]:
union = pd.Series(np.union1d(s1, s2))
intersection = pd.Series(np.intersect1d(s1, s2))

print(union[~union.isin(intersection)])

0     1
1     2
2     3
7     8
8     9
9    10
dtype: int64

**Q4**. Again, we create two new Series: *alphabet* and *indices*. Display the letters from the Series *alphabet* corresponding the indexes contained in *indices*

In [19]:
alphabet = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
indices = pd.Series([7, 4, 11, 11, 14])

In [21]:
# TODO : Display the letters from alphabet correponding to the indexes contained in indices
### START ###  

alphabet[indices]
### END ###

7     h
4     e
11    l
11    l
14    o
dtype: object

**Q5**. Finally, we create new Series *random_series* of 20 random integers (between 1 and 8), in order to work on **reproductible results**, we specify a **random seed** of 0.
Find the most frequent values in random_series and replace the other values by -1

In [25]:
np.random.seed(0)
random_series = pd.Series(np.random.randint(1, 8, 20))

In [27]:
# TODO : Find the two most frequent values of random_series
# and replace all oter values by -1

random_series.value_counts()

4    4
1    4
7    3
5    3
6    2
3    2
2    2
dtype: int64

In [35]:
# method2
most_frequent = random_series.value_counts()[:2]

random_series_new = random_series

random_series_new[~random_series_new.isin(most_frequent)] = -1

In [36]:
random_series_new

0    -1
1    -1
2    -1
3     4
4     4
5     4
6    -1
7     4
8    -1
9    -1
10   -1
11   -1
12   -1
13   -1
14   -1
15   -1
16   -1
17   -1
18   -1
19   -1
dtype: int32

**SOME TECHNIQUES**

In [3]:
df = pd.DataFrame({'name': ['Geordi La Forge', 'Deanna Troi', 'Data']})
df

              name
0  Geordi La Forge
1      Deanna Troi
2             Data

In [10]:
df['first name'] = df.name.str.split(n=1).str[0]

df['last name'] = df.name.str.split(n=1).str[1]
df

              name first name last name
0  Geordi La Forge     Geordi  La Forge
1      Deanna Troi     Deanna      Troi
2             Data       Data       NaN

In [12]:
import os 

path_to_movie = os.path.join('..','data','movies.csv')
movies = pd.read_csv(path_to_movie)
movies.head()

,Unnamed: 0,star_rating,title,content_rating,genre,duration,actors_list
0,0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [17]:
# Step1

frequencies = movies.genre.value_counts(normalize=True)
frequencies

Drama        0.283963
Comedy       0.159346
Action       0.138917
Crime        0.126660
Biography    0.078652
Adventure    0.076609
Animation    0.063330
Horror       0.029622
Mystery      0.016343
Western      0.009193
Sci-Fi       0.005107
Thriller     0.005107
Film-Noir    0.003064
Family       0.002043
History      0.001021
Fantasy      0.001021
Name: genre, dtype: float64

In [18]:
# Step 2 : 
small_categories = frequencies[frequencies < 0.10].index
small_categories

Index(['Biography', 'Adventure', 'Animation', 'Horror', 'Mystery', 'Western',
       'Sci-Fi', 'Thriller', 'Film-Noir', 'Family', 'History', 'Fantasy'],
      dtype='object')

In [19]:
# Step3

genre_update = movies.genre.replace(small_categories, 'other')
# result
genre_update.value_counts(normalize=True)

other     0.291113
Drama     0.283963
Comedy    0.159346
Action    0.138917
Crime     0.126660
Name: genre, dtype: float64

In [1]:
import pandas as pd

df = pd.DataFrame({'gender':['male','female','male','female'],'color':['red','green','red','blue'],'age':[25, 40, 10, 30]})
df.head()

   gender  color  age
0    male    red   25
1  female  green   40
2    male    red   10
3  female   blue   30

In [2]:
df['gender_letter'] = df.gender.map({'male':'M','female':'F'})
df

   gender  color  age gender_letter
0    male    red   25             M
1  female  green   40             F
2    male    red   10             M
3  female   blue   30             F

In [3]:
df['color_num'] = df.color.factorize()[0]
df

   gender  color  age gender_letter  color_num
0    male    red   25             M          0
1  female  green   40             F          1
2    male    red   10             M          0
3  female   blue   30             F          2

In [4]:
df.color.factorize()

(array([0, 1, 0, 2], dtype=int64),
 Index(['red', 'green', 'blue'], dtype='object'))

In [5]:
df['can_vote'] = df.age >= 18
df

   gender  color  age gender_letter  color_num  can_vote
0    male    red   25             M          0      True
1  female  green   40             F          1      True
2    male    red   10             M          0     False
3  female   blue   30             F          2      True

In [7]:
df = pd.DataFrame({'customer':['A','B','C','D'], 'sales':[1100, 950.75, '$800.00', '$1,250.25']})
df

  customer      sales
0        A       1100
1        B     950.75
2        C    $800.00
3        D  $1,250.25

In [8]:
df.sales.apply(type)
# there are mixed data types in the 'sales' columns

0      <class 'int'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
Name: sales, dtype: object

In [9]:
# replace dollar sign or comma with an empty string
df['sales'] = df.sales.replace('[$,]','',regex=True).astype('float')
df

  customer    sales
0        A  1100.00
1        B   950.75
2        C   800.00
3        D  1250.25

In [10]:
df.sales.apply(type) # nice

0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
Name: sales, dtype: object

In [11]:
df = pd.read_csv('http://bit.ly/imdbratings')

In [12]:
# count of missing values in each column
df.isna().sum()

star_rating       0
title             0
content_rating    3
genre             0
duration          0
actors_list       0
dtype: int64

In [13]:
# count of missing values *total*

df.isna().sum().sum()

3

In [15]:
# are there missing values in each column?
df.isna().any()

star_rating       False
title             False
content_rating     True
genre             False
duration          False
actors_list       False
dtype: bool

In [17]:
df.isna().any()[df.isna().any()==True].index

Index(['content_rating'], dtype='object')

In [18]:
df = pd.DataFrame({'zip_code':[12345,34567, 6789], 'factory':[100, 400, 700], 'wahehouse':[200, 500, 800], 'retail':[300, 600, 900]})
df

   zip_code  factory  wahehouse  retail
0     12345      100        200     300
1     34567      400        500     600
2      6789      700        800     900

In [19]:
df.melt(id_vars = 'zip_code', var_name='location_type',
    value_name='distance')

   zip_code location_type  distance
0     12345       factory       100
1     34567       factory       400
2      6789       factory       700
3     12345     wahehouse       200
4     34567     wahehouse       500
5      6789     wahehouse       800
6     12345        retail       300
7     34567        retail       600
8      6789        retail       900

In [20]:
df = pd.read_csv('http://bit.ly/imdbratings')
df.shape

(979, 6)

In [22]:
import numpy as np

df = pd.read_csv('http://bit.ly/imdbratings', skiprows = lambda x: x > 0 and np.random.rand()>0.5)
df.shape

(496, 6)

In [24]:
import os
path_to_csv = os.path.join('..','data','kaggletrain.csv')
titanic = pd.read_csv(path_to_csv, usecols= ['Fare', 'Embarked','Sex','Age'])
titanic.head()

      Sex   Age     Fare Embarked
0    male  22.0   7.2500        S
1  female  38.0  71.2833        C
2  female  26.0   7.9250        S
3  female  35.0  53.1000        S
4    male  35.0   8.0500        S